nicolas-codemate/esp32-pixelcast/src/main.cpp
// Notification management
void notifInit();
int8_t notifAdd(const char* id, const char* text, const char* icon,
                uint32_t textColor, uint32_t bgColor, uint16_t duration,
                bool hold, bool urgent, bool stack);
bool notifDismiss();
void notifClearAll();
NotificationItem* notifGetCurrent();
NotificationItem* notifGetNext();
bool notifIsExpired(NotificationItem* notif);
void displayShowNotification(NotificationItem* notif);
void resetNotifScrollState();

// Indicator management
void indicatorInit();
void indicatorSet(uint8_t index, IndicatorMode mode, uint32_t color,
                  uint16_t blinkInterval, uint16_t fadePeriod);
void indicatorOff(uint8_t index);
void drawIndicators();
bool indicatorNeedsRedraw();
void handleIndicatorApi(AsyncWebServerRequest *request, JsonVariant &json, uint8_t index);

void mqttCallback(char* topic, byte* payload, unsigned int length);
bool mqttConnect();
void mqttPublishStats();
void mqttHandleCustom(const char* name, JsonObject& doc);
void mqttHandleCustomDelete(const char* name);
void mqttHandleNotify(JsonObject& doc);
void mqttHandleDismiss();
void mqttHandleIndicator(uint8_t index, JsonObject& doc);
void mqttHandleWeather(JsonObject& doc);
void mqttHandleTracker(const char* name, JsonObject& doc);
void mqttHandleTrackerDelete(const char* name);
void mqttHandleSettings(JsonObject& doc);
void mqttHandleBrightness(JsonObject& doc);
void mqttHandleReboot();

void handleApiStats(AsyncWebServerRequest *request);
void handleApiSettings(AsyncWebServerRequest *request);
void handleApiApps(AsyncWebServerRequest *request);

void logMemory();

bool sleepIsActive();
static bool dayIndexFromName(const char* name, uint8_t& outIndex);
static const char* dayNameFromIndex(uint8_t index);
static bool parseHourMinute(const char* text, uint8_t& outHour, uint8_t& outMinute);
static void formatHourMinute(uint8_t hour, uint8_t minute, char* out, size_t outSize);
static const char* sleepReasonToString(SleepReason reason);
static void buildSleepConfigJson(JsonObject root);
static bool applySleepUpdate(JsonObject body, String& errorOut);
static void wakeNow();

// ============================================================================
// Setup
// ============================================================================

void setup() {
    Serial.begin(115200);
    delay(100);

    Serial.println();
    Serial.println("========================================");
    Serial.println("   ESP32-PixelCast v" VERSION_STRING);
    Serial.println("   HUB75 LED Matrix Display Firmware");
    Serial.println("========================================");
    Serial.println();

    logMemory();

    Serial.println("[INIT] Setting up display...");
    setupDisplay();
    displayShowBoot();

    Serial.println("[INIT] Setting up filesystem...");
    setupFilesystem();

    // Initialize weather data as empty
    memset(&weatherData, 0, sizeof(weatherData));

    // Initialize tracker system
    trackerInit();

    // Initialize notification system
    notifInit();

    // Initialize indicator system (defaults set before loadSettings overrides)
    indicatorInit();

    Serial.println("[INIT] Loading settings...");
    if (!loadSettings()) {
        Serial.println("[INIT] Using default settings");
        initDefaultSettings();
    }
    displaySetBrightness(settings.brightness);

    Serial.println("[INIT] Setting up WiFi...");
    setupWiFi();

    if (wifiConnected) {
        Serial.println("[INIT] Setting up mDNS...");
        setupMDNS();

        Serial.println("[INIT] Setting up web server...");
        setupWebServer();

        Serial.println("[INIT] Setting up MQTT...");
        setupMQTT();

        Serial.println("[INIT] Setting up OTA...");
        ArduinoOTA.setHostname(MDNS_NAME);
        ArduinoOTA.onStart([]() {
            Serial.println("[OTA] Update starting...");
            dma_display->fillScreen(0);
            dma_display->setTextSize(1);
            dma_display->setTextColor(dma_display->color565(255, 165, 0));
            // "OTA" default font, centered (3 chars x 6px = 18px)
            dma_display->setCursor(23, 4);
            dma_display->print("OTA");
            // "UPDATE" same font, centered (6 chars x 6px = 36px)
            dma_display->setCursor(14, 18);
            dma_display->print("UPDATE");
            // Progress bar frame near bottom
            dma_display->drawRect(4, 46, 56, 7, dma_display->color565(80, 80, 80));
            #if DOUBLE_BUFFER
                dma_display->flipDMABuffer();
            #endif
        });
        ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
            static uint8_t lastPercent = 255;
            uint8_t percent = (uint8_t)((progress * 100) / total);
            // Only redraw every 5% to avoid slowing down OTA transfer
            if (percent == lastPercent || (percent % 5 != 0 && percent != 100)) return;
            lastPercent = percent;
            uint8_t barWidth = (uint8_t)((progress * 54) / total);
            if (barWidth > 0) {
                dma_display->fillRect(5, 47, barWidth, 5,
                    dma_display->color565(255, 165, 0));
            }
            dma_display->fillRect(0, 56, 64, 8, 0);
            char buf[8];
            snprintf(buf, sizeof(buf), "%d%%", percent);
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(dma_display->color565(150, 150, 150));
            int16_t textW = strlen(buf) * 4;
            dma_display->setCursor((64 - textW) / 2, 60);
            dma_display->print(buf);
            dma_display->setFont(NULL);
        });
        ArduinoOTA.onEnd([]() {
            Serial.println("[OTA] Update complete!");
            dma_display->fillScreen(0);
            dma_display->setTextColor(dma_display->color565(0, 255, 0));
            dma_display->setCursor(13, 24);
            dma_display->print("DONE");
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(dma_display->color565(100, 100, 100));
            dma_display->setCursor(8, 38);
            dma_display->print("Rebooting...");
            dma_display->setFont(NULL);
            #if DOUBLE_BUFFER
                dma_display->flipDMABuffer();
            #endif
        });
        ArduinoOTA.onError([](ota_error_t error) {
            Serial.printf("[OTA] Error[%u]\n", error);
            dma_display->fillScreen(0);
            dma_display->setTextColor(dma_display->color565(255, 0, 0));
            dma_display->setCursor(7, 28);
            dma_display->print("OTA ERR");
            #if DOUBLE_BUFFER
                dma_display->flipDMABuffer();
            #endif
        });
        ArduinoOTA.begin();

        Serial.println("[INIT] Setting up NTP...");
        configTzTime(settings.tzPosix, settings.ntpServer);

        displayShowIP();
        delay(2000);

        Serial.println("[INIT] Initializing icon cache...");
        initIconCache();

