nicolas-codemate/esp32-pixelcast/src/main.cpp
    delay(3000);
}

void displayShowTime() {
    dma_display->clearScreen();

    time_t nowUtc = time(nullptr);
    struct tm localTm;
    localtime_r(&nowUtc, &localTm);
    int hours = localTm.tm_hour;
    int minutes = localTm.tm_min;
    int seconds = localTm.tm_sec;

    // Apply 12h format if configured
    if (!settings.clockFormat24h && hours > 12) {
        hours -= 12;
    }

    // Format time string
    char timeStr[9];
    if (settings.clockShowSeconds) {
        snprintf(timeStr, sizeof(timeStr), "%02d:%02d:%02d", hours, minutes, seconds);
    } else {
        snprintf(timeStr, sizeof(timeStr), "%02d:%02d", hours, minutes);
    }

    // Extract RGB from color
    uint8_t r = (settings.clockColor >> 16) & 0xFF;
    uint8_t g = (settings.clockColor >> 8) & 0xFF;
    uint8_t b = settings.clockColor & 0xFF;

    // Draw time centered
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    // Center text based on format
    int textWidth = settings.clockShowSeconds ? 48 : 30;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(timeStr);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowDate() {
    dma_display->clearScreen();

    time_t nowUtc = time(nullptr);
    struct tm localTm;
    localtime_r(&nowUtc, &localTm);

    uint8_t day = localTm.tm_mday;
    uint8_t month = localTm.tm_mon + 1;
    uint16_t year = localTm.tm_year + 1900;

    // Format date string based on settings
    char dateStr[16];
    if (strcmp(settings.dateFormat, "MM/DD/YYYY") == 0) {
        snprintf(dateStr, sizeof(dateStr), "%02u/%02u/%04u", month, day, year);
    } else if (strcmp(settings.dateFormat, "YYYY-MM-DD") == 0) {
        snprintf(dateStr, sizeof(dateStr), "%04u-%02u-%02u", year, month, day);
    } else {
        // Default: DD/MM/YYYY
        snprintf(dateStr, sizeof(dateStr), "%02u/%02u/%04u", day, month, year);
    }

    // Extract RGB from color
    uint8_t r = (settings.dateColor >> 16) & 0xFF;
    uint8_t g = (settings.dateColor >> 8) & 0xFF;
    uint8_t b = settings.dateColor & 0xFF;

    // Draw date centered
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    int textWidth = 60;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(dateStr);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// Draw icon at explicit scale (1 = native, 2 = upscale x2)
void drawIconAtScale(CachedIcon* icon, int16_t x, int16_t y, uint8_t scale) {
    if (!icon || !icon->valid || !icon->pixels) return;

    for (uint8_t py = 0; py < icon->height; py++) {
        for (uint8_t px = 0; px < icon->width; px++) {
            uint16_t pixel = icon->pixels[py * icon->width + px];
            if (pixel != 0) {
                if (scale == 2) {
                    int16_t dx = x + px * 2;
                    int16_t dy = y + py * 2;
                    dma_display->drawPixel(dx, dy, pixel);
                    dma_display->drawPixel(dx + 1, dy, pixel);
                    dma_display->drawPixel(dx, dy + 1, pixel);
                    dma_display->drawPixel(dx + 1, dy + 1, pixel);
                } else {
                    dma_display->drawPixel(x + px, y + py, pixel);
                }
            }
        }
    }
}

// Draw a small water drop icon (5px tall)
void drawDropIcon(int16_t x, int16_t y, uint16_t color) {
    //   .X.
    //   .X.
    //   XXX
    //   XXX
    //   .X.
    dma_display->drawPixel(x + 1, y,     color);
    dma_display->drawPixel(x + 1, y + 1, color);
    dma_display->drawPixel(x,     y + 2, color);
    dma_display->drawPixel(x + 1, y + 2, color);
    dma_display->drawPixel(x + 2, y + 2, color);
    dma_display->drawPixel(x,     y + 3, color);
    dma_display->drawPixel(x + 1, y + 3, color);
    dma_display->drawPixel(x + 2, y + 3, color);
    dma_display->drawPixel(x + 1, y + 4, color);
}

// Draw a thin horizontal separator line
void drawSeparatorLine(int16_t y, uint16_t color) {
    for (int16_t x = 4; x < DISPLAY_WIDTH - 4; x++) {
        dma_display->drawPixel(x, y, color);
    }
}

// ============================================================================
// Weather Data Functions
// ============================================================================

void weatherParseTodayBlock(JsonObjectConst todayBlock)
{
    weatherData.today.hourCount = 0;
    weatherData.today.segmentCount = 0;

    if (todayBlock.isNull())
    {
        return;
    }

    if (todayBlock["hours"].is<JsonArrayConst>())
    {
        JsonArrayConst hoursArray = todayBlock["hours"];
        int hourCount = min((int)hoursArray.size(), (int)MAX_TODAY_HOURS);
        for (int i = 0; i < hourCount; i++)
        {
            JsonObjectConst hourObject = hoursArray[i];
            TodayHour* hourSlot = &weatherData.today.hours[i];
            hourSlot->hour = constrain((int)(hourObject["h"] | 0), 0, 23);
            // No reading on Earth comes near +/-100 C, and a wider span would
            // overflow the int16_t arithmetic behind the curve
            hourSlot->temp = constrain((int)(hourObject["temp"] | 0), -100, 100);
            hourSlot->precipProbability = constrain((int)(hourObject["pop"] | 0), 0, 100);
            hourSlot->precipTenthsOfMm = constrain((int)(hourObject["precip"] | 0), 0, 255);
        }
        weatherData.today.hourCount = hourCount;
    }

    if (todayBlock["segments"].is<JsonArrayConst>())
    {
        JsonArrayConst segmentsArray = todayBlock["segments"];
        int segmentCount = min((int)segmentsArray.size(), (int)MAX_TODAY_SEGMENTS);
        for (int i = 0; i < segmentCount; i++)
        {
            JsonObjectConst segmentObject = segmentsArray[i];
            TodaySegment* segmentSlot = &weatherData.today.segments[i];
            segmentSlot->fromHour = constrain((int)(segmentObject["from"] | 0), 0, 23);
            segmentSlot->toHour = constrain((int)(segmentObject["to"] | 0), 0, 23);
            strlcpy(segmentSlot->icon, segmentObject["icon"] | "", sizeof(segmentSlot->icon));
        }
        weatherData.today.segmentCount = segmentCount;
    }
}

// ============================================================================
// Tracker Functions
// ============================================================================

TrackerData* trackerFind(const char* name) {
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (trackers[i].valid && strcmp(trackers[i].name, name) == 0) {
            return &trackers[i];
        }
    }
    return nullptr;
}

TrackerData* trackerAllocate(const char* name) {
    // Check if already exists
    TrackerData* existing = trackerFind(name);
    if (existing) return existing;

    // Find first free slot
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (!trackers[i].valid) {
            memset(&trackers[i], 0, sizeof(TrackerData));
            strlcpy(trackers[i].name, name, sizeof(trackers[i].name));
            trackers[i].symbolColor = 0xFFFFFF;    // Default white
            trackers[i].sparklineColor = 0x00D4FF;  // Default cyan
            strlcpy(trackers[i].sparklinePeriod, "24h", sizeof(trackers[i].sparklinePeriod));
            trackers[i].valid = true;
            trackerCount++;
            return &trackers[i];
        }
    }
    return nullptr;
}

bool trackerRemove(const char* name) {
    TrackerData* tracker = trackerFind(name);
    if (!tracker) return false;

    tracker->valid = false;
    trackerCount--;

