nicolas-codemate/esp32-pixelcast/src/main.cpp
// Serialize text field in polymorphic format for JSON output
void serializeTextField(JsonObject& obj, const char* fieldName, const char* text,
                        const TextSegment* segments, uint8_t segmentCount) {
    if (segmentCount == 0) {
        obj[fieldName] = text;
        return;
    }

    // Build array of {t, c} segments
    JsonArray arr = obj[fieldName].to<JsonArray>();
    size_t textLen = strlen(text);
    for (uint8_t i = 0; i < segmentCount; i++) {
        JsonObject seg = arr.add<JsonObject>();
        // Extract substring from offset to next segment (or end)
        size_t start = segments[i].offset;
        size_t end = (i + 1 < segmentCount) ? segments[i + 1].offset : textLen;
        if (start >= textLen) break;
        if (end > textLen) end = textLen;

        // Copy substring
        char buf[64];
        size_t len = end - start;
        if (len >= sizeof(buf)) len = sizeof(buf) - 1;
        memcpy(buf, text + start, len);
        buf[len] = '\0';
        seg["t"] = (const char*)buf;

        char colorHex[8];
        formatColorHex(segments[i].color, colorHex, sizeof(colorHex));
        seg["c"] = (const char*)colorHex;
    }
}

// Draw sparkline chart from scaled uint16 data
void drawSparkline(const uint16_t* data, uint8_t count, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
    if (count < 2) return;

    // Find data min/max for vertical scaling
    uint16_t dataMin = 65535;
    uint16_t dataMax = 0;
    for (uint8_t i = 0; i < count; i++) {
        if (data[i] < dataMin) dataMin = data[i];
        if (data[i] > dataMax) dataMax = data[i];
    }

    uint16_t dataRange = dataMax - dataMin;
    if (dataRange == 0) dataRange = 1;

    // Plot line segments between consecutive points
    for (uint8_t i = 0; i < count - 1; i++) {
        int16_t x0 = x + (int32_t)i * (w - 1) / (count - 1);
        int16_t x1 = x + (int32_t)(i + 1) * (w - 1) / (count - 1);
        // Invert Y: high value = top of chart
        int16_t y0 = y + h - 1 - (int32_t)(data[i] - dataMin) * (h - 1) / dataRange;
        int16_t y1 = y + h - 1 - (int32_t)(data[i + 1] - dataMin) * (h - 1) / dataRange;
        dma_display->drawLine(x0, y0, x1, y1, color);
    }
}

// Draw a small up/down arrow (5x5 pixels)
void drawTrackerArrow(int16_t x, int16_t y, bool up, uint16_t color) {
    if (up) {
        //   ..X..
        //   .XXX.
        //   XXXXX
        //   ..X..
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 1, y + 1, color);
        dma_display->drawPixel(x + 2, y + 1, color);
        dma_display->drawPixel(x + 3, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    } else {
        //   ..X..
        //   ..X..
        //   XXXXX
        //   .XXX.
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 2, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 1, y + 3, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 3, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    }
}

// Smart value formatting with thousand separators
void formatTrackerValue(float value, char* buffer, size_t bufSize) {
    if (value >= 1000.0f) {
        // Integer with thousand separator
        uint32_t intVal = (uint32_t)value;
        // Build string with commas from right to left
        char tmp[20];
        int len = snprintf(tmp, sizeof(tmp), "%lu", (unsigned long)intVal);
        int commas = (len - 1) / 3;
        int outLen = len + commas;
        if ((size_t)outLen >= bufSize) {
            snprintf(buffer, bufSize, "%lu", (unsigned long)intVal);
            return;
        }
        buffer[outLen] = '\0';
        int srcIdx = len - 1;
        int dstIdx = outLen - 1;
        int digitCount = 0;
        while (srcIdx >= 0) {
            buffer[dstIdx--] = tmp[srcIdx--];
            digitCount++;
            if (digitCount % 3 == 0 && srcIdx >= 0) {
                buffer[dstIdx--] = ',';
            }
        }
    } else if (value >= 1.0f) {
        snprintf(buffer, bufSize, "%.2f", value);
    } else {
        snprintf(buffer, bufSize, "%.5f", value);
    }
}

// Display tracker layout on 64x64 matrix
void displayShowTracker(TrackerData* tracker) {
    if (!tracker) return;

    unsigned long trackerAge = millis() - tracker->lastUpdate;
    bool isStale = (trackerAge > TRACKER_STALE_TIMEOUT);

    // A tracker screen shows a fixed snapshot, so it only has to be painted when the data
    // arrives or when it goes stale. Repainting it every second would blank the framebuffer
    // the DMA is reading, which shows up as flicker on single-buffered builds.
    bool needsFullRedraw = (trackerLastUpdateDrawn != tracker->lastUpdate) ||
                           (trackerStaleDrawn != isStale);

    if (!needsFullRedraw) {
        drawIndicators();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        return;
    }

    trackerLastUpdateDrawn = tracker->lastUpdate;
    trackerStaleDrawn = isStale;

    dma_display->clearScreen();

    // Color helpers
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimWhite = isStale ? dma_display->color565(60, 60, 60) : dma_display->color565(150, 150, 150);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t green = isStale ? dma_display->color565(0, 60, 0) : dma_display->color565(0, 200, 0);
    uint16_t red = isStale ? dma_display->color565(60, 0, 0) : dma_display->color565(200, 0, 0);

    uint8_t symR = (tracker->symbolColor >> 16) & 0xFF;
    uint8_t symG = (tracker->symbolColor >> 8) & 0xFF;
    uint8_t symB = tracker->symbolColor & 0xFF;
    uint16_t symbolColor565 = isStale
        ? dma_display->color565(symR / 4, symG / 4, symB / 4)
        : dma_display->color565(symR, symG, symB);

    uint8_t spkR = (tracker->sparklineColor >> 16) & 0xFF;
    uint8_t spkG = (tracker->sparklineColor >> 8) & 0xFF;
    uint8_t spkB = tracker->sparklineColor & 0xFF;
    uint16_t sparklineColor565 = isStale
        ? dma_display->color565(spkR / 4, spkG / 4, spkB / 4)
        : dma_display->color565(spkR, spkG, spkB);

