nicolas-codemate/esp32-pixelcast/src/main.cpp
    uint8_t channelValue[3];
    for (uint8_t channel = 0; channel < 3; channel++)
    {
        int16_t fromValue = (int16_t)rampStops[lowerStop][channel + 1];
        int16_t toValue = (int16_t)rampStops[upperStop][channel + 1];
        int16_t interpolated = fromValue +
            (int16_t)((int32_t)(toValue - fromValue) * positionInStop / stopDistance);
        channelValue[channel] = (uint8_t)interpolated;
    }

    return dma_display->color565(channelValue[0], channelValue[1], channelValue[2]);
}

int16_t todayColumnCenterX(uint8_t hourIndex)
{
    return TODAY_FIRST_COLUMN_X + TODAY_HOUR_PITCH_X * (int16_t)hourIndex;
}

// Called twice: once with fillArea before the rain bars, once without after them,
// so the crest stays readable where a bar crosses it.
void displayDrawTodayCurve(const TodayWindow* today, const int16_t* pointY,
                           int16_t lastColumnX, bool fillArea)
{
    uint16_t areaTint = dma_display->color565(26, 32, 50);
    uint8_t lastHourIndex = today->hourCount - 1;
    int16_t previousColumnY = -1;

    for (int16_t columnX = 0; columnX <= lastColumnX; columnX++)
    {
        // Flat lead-in and lead-out: the first and last hours own the columns
        // outside their centres, so the crest spans the whole axis
        uint8_t anchorIndex = 0;
        int16_t offsetWithinHour = 0;
        if (columnX >= todayColumnCenterX(lastHourIndex))
        {
            anchorIndex = lastHourIndex;
        }
        else if (columnX > todayColumnCenterX(0))
        {
            anchorIndex = (uint8_t)((columnX - TODAY_FIRST_COLUMN_X) / TODAY_HOUR_PITCH_X);
            offsetWithinHour = columnX - todayColumnCenterX(anchorIndex);
        }

        int16_t columnY = pointY[anchorIndex];
        int16_t columnTemperatureTenths = (int16_t)today->hours[anchorIndex].temp * 10;
        if (offsetWithinHour > 0)
        {
            int16_t rowSpan = pointY[anchorIndex + 1] - pointY[anchorIndex];
            // The row is rounded as a whole rather than the offset alone, so a
            // half-row tie lands one row lower, like the reference render
            int32_t scaledRow = (int32_t)pointY[anchorIndex] * 2 * TODAY_HOUR_PITCH_X +
                                2 * (int32_t)rowSpan * offsetWithinHour + TODAY_HOUR_PITCH_X;
            columnY = (int16_t)(scaledRow / (2 * TODAY_HOUR_PITCH_X));

            int16_t temperatureSpanTenths =
                ((int16_t)today->hours[anchorIndex + 1].temp -
                 (int16_t)today->hours[anchorIndex].temp) * 10;
            columnTemperatureTenths +=
                (int16_t)((int32_t)temperatureSpanTenths * offsetWithinHour / TODAY_HOUR_PITCH_X);
        }

        uint16_t crestColor =
            weatherTemperatureRampColor(weatherTemperatureWarmth(columnTemperatureTenths));

        if (fillArea && columnY < TODAY_AREA_FLOOR_Y)
        {
            dma_display->drawFastVLine(columnX, columnY + 1,
                                       TODAY_AREA_FLOOR_Y - columnY, areaTint);
        }

        if (previousColumnY >= 0)
        {
            // A jump of more than one row would leave the crest as a dotted line
            int16_t rowsClimbed = abs(columnY - previousColumnY);
            if (rowsClimbed > 1)
            {
                dma_display->drawFastVLine(columnX, min(columnY, previousColumnY),
                                           rowsClimbed + 1, crestColor);
            }
        }
        dma_display->drawPixel(columnX, columnY, crestColor);

        previousColumnY = columnY;
    }
}

void displayDrawTodayRainTotal(const TodayWindow* today, uint16_t rainColor)
{
    uint16_t totalTenthsOfMm = 0;
    for (uint8_t i = 0; i < today->hourCount; i++)
    {
        totalTenthsOfMm += today->hours[i].precipTenthsOfMm;
    }

    if (totalTenthsOfMm == 0)
    {
        return;
    }

    // A tenth of a millimetre stops being worth a character above 10 mm
    char totalLabel[8];
    if (totalTenthsOfMm >= 100)
    {
        snprintf(totalLabel, sizeof(totalLabel), "%d", (totalTenthsOfMm + 5) / 10);
    }
    else
    {
        snprintf(totalLabel, sizeof(totalLabel), "%d.%d",
                 totalTenthsOfMm / 10, totalTenthsOfMm % 10);
    }

    int16_t numberWidth = calculateTomThumbTextWidth(totalLabel);
    int16_t labelWidth = numberWidth + 1 + MILLIMETRE_GLYPH_WIDTH;
    int16_t labelX = (DISPLAY_WIDTH - labelWidth) / 2;

    dma_display->setFont(&TomThumb);
    dma_display->setTextColor(rainColor);
    dma_display->setCursor(labelX, TODAY_EXTREMES_TOP_Y + 5);
    dma_display->print(totalLabel);
    drawMillimetreGlyph(labelX + numberWidth + 1, TODAY_EXTREMES_TOP_Y, rainColor);
    dma_display->setFont(NULL);
}

void displayShowTodayChart(const TodayWindow* today)
{
    // ============================================================
    // Layout map of the hourly page (y=32-63 of weatherclock)
    // A TomThumb glyph paints from baseline-5 to baseline-1, so a band whose
    // top row is Y is written with setCursor(_, Y + 5).
    // ============================================================
    // y=33-37:  summary row - window maximum, rain total, window minimum,
    //           the two temperatures each in its own ramp hue
    // y=40-54:  temperature crest, one pixel per column
    // y=43-55:  rain bars, hanging from the top of their height onto the axis
    // y=41-55:  area under the crest
    // y=56:     axis, brighter every four hours
    // y=58-62:  hour labels every four hours
    // ============================================================

    uint16_t labelGray = dma_display->color565(100, 100, 100);
    uint16_t axisGray = dma_display->color565(40, 40, 40);
    uint16_t lightRainBlue = dma_display->color565(0, 90, 180);
    uint16_t heavyRainBlue = dma_display->color565(0, 170, 255);

    int16_t temperatureMin = today->hours[0].temp;
    int16_t temperatureMax = today->hours[0].temp;
    for (uint8_t i = 1; i < today->hourCount; i++)
    {
        temperatureMin = min(temperatureMin, today->hours[i].temp);
        temperatureMax = max(temperatureMax, today->hours[i].temp);
    }

    // ---- Window extremes (y=33-37) ----
    dma_display->setFont(&TomThumb);

    char maxLabel[8];
    snprintf(maxLabel, sizeof(maxLabel), "%d", temperatureMax);
    uint16_t maxColor = weatherTemperatureRampColor(weatherTemperatureWarmth(temperatureMax * 10));
    dma_display->setTextColor(maxColor);
    dma_display->setCursor(TODAY_EXTREMES_LEFT_X, TODAY_EXTREMES_TOP_Y + 5);
    dma_display->print(maxLabel);
    drawDegreeGlyph(TODAY_EXTREMES_LEFT_X + calculateTomThumbTextWidth(maxLabel),
                    TODAY_EXTREMES_TOP_Y, maxColor);

