nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Display settings
    settings.brightness = doc["display"]["brightness"] | DEFAULT_BRIGHTNESS;
    settings.autoRotate = doc["display"]["autoRotate"] | true;
    settings.defaultDuration = doc["display"]["defaultDuration"] | DEFAULT_APP_DURATION;

    // NTP settings
    const char* ntpSrv = doc["ntp"]["server"] | NTP_SERVER;
    strlcpy(settings.ntpServer, ntpSrv, sizeof(settings.ntpServer));

    if (doc["ntp"]["tz_posix"].is<const char*>()) {
        strlcpy(settings.tzPosix, doc["ntp"]["tz_posix"].as<const char*>(), sizeof(settings.tzPosix));
    } else {
        strlcpy(settings.tzPosix, DEFAULT_TZ_POSIX, sizeof(settings.tzPosix));
        if (!doc["ntp"]["offset"].isNull()) {
            Serial.println("[NTP] Legacy ntp.offset ignored, applying default tz_posix");
        }
    }

    // WeatherClock app settings
    uint32_t storedWeatherDuration = doc["apps"]["weatherclock"]["duration"] | (uint32_t)DEFAULT_WEATHER_DURATION;
    settings.weatherDuration = constrain(storedWeatherDuration,
                                         (uint32_t)MIN_WEATHER_DURATION,
                                         (uint32_t)MAX_WEATHER_DURATION);

    // Clock app settings
    settings.clockEnabled = doc["apps"]["clock"]["enabled"] | true;
    settings.clockFormat24h = doc["apps"]["clock"]["format24h"] | true;
    settings.clockShowSeconds = doc["apps"]["clock"]["showSeconds"] | true;

    JsonArray clockColorArr = doc["apps"]["clock"]["color"];
    if (clockColorArr.size() == 3) {
        settings.clockColor = ((uint32_t)clockColorArr[0].as<uint8_t>() << 16) |
                              ((uint32_t)clockColorArr[1].as<uint8_t>() << 8) |
                              (uint32_t)clockColorArr[2].as<uint8_t>();
    } else {
        settings.clockColor = 0xFFFFFF;
    }

    // Date app settings
    settings.dateEnabled = doc["apps"]["date"]["enabled"] | true;
    const char* dateFmt = doc["apps"]["date"]["format"] | "DD/MM/YYYY";
    strlcpy(settings.dateFormat, dateFmt, sizeof(settings.dateFormat));

    JsonArray dateColorArr = doc["apps"]["date"]["color"];
    if (dateColorArr.size() == 3) {
        settings.dateColor = ((uint32_t)dateColorArr[0].as<uint8_t>() << 16) |
                             ((uint32_t)dateColorArr[1].as<uint8_t>() << 8) |
                             (uint32_t)dateColorArr[2].as<uint8_t>();
    } else {
        settings.dateColor = 0x6464FF;
    }

    // MQTT settings
    settings.mqttEnabled = doc["mqtt"]["enabled"] | false;
    const char* mqttSrv = doc["mqtt"]["server"] | "";
    strlcpy(settings.mqttServer, mqttSrv, sizeof(settings.mqttServer));
    settings.mqttPort = doc["mqtt"]["port"] | 1883;
    const char* mqttUsr = doc["mqtt"]["user"] | "";
    strlcpy(settings.mqttUser, mqttUsr, sizeof(settings.mqttUser));
    const char* mqttPwd = doc["mqtt"]["password"] | "";
    strlcpy(settings.mqttPassword, mqttPwd, sizeof(settings.mqttPassword));
    const char* mqttPfx = doc["mqtt"]["prefix"] | MQTT_PREFIX;
    strlcpy(settings.mqttPrefix, mqttPfx, sizeof(settings.mqttPrefix));

    // Indicator settings
    for (int i = 0; i < NUM_INDICATORS; i++) {
        String key = String(i + 1);
        JsonObject indObj = doc["indicators"][key];
        if (indObj.isNull()) continue;

        const char* modeStr = indObj["mode"] | "off";
        IndicatorMode mode = INDICATOR_OFF;
        if (strcmp(modeStr, "solid") == 0) mode = INDICATOR_SOLID;
        else if (strcmp(modeStr, "blink") == 0) mode = INDICATOR_BLINK;
        else if (strcmp(modeStr, "fade") == 0) mode = INDICATOR_FADE;

        // Backward compatibility: old format had "enabled" boolean
        if (mode == INDICATOR_OFF && indObj["mode"].isNull() && indObj["enabled"].as<bool>()) {
            mode = INDICATOR_SOLID;
        }

        uint32_t color = indicators[i].color;  // Keep default if not provided
        JsonArray colorArr = indObj["color"];
        if (colorArr.size() == 3) {
            color = ((uint32_t)colorArr[0].as<uint8_t>() << 16) |
                    ((uint32_t)colorArr[1].as<uint8_t>() << 8) |
                    (uint32_t)colorArr[2].as<uint8_t>();
        }

        uint16_t blinkInterval = indObj["blinkInterval"] | (uint16_t)INDICATOR_BLINK_INTERVAL;
        uint16_t fadePeriod = indObj["fadePeriod"] | (uint16_t)INDICATOR_FADE_PERIOD;

        indicatorSet(i, mode, color, blinkInterval, fadePeriod);
    }

    // Sleep settings
    settings.sleep.enabled = doc["sleep"]["enabled"] | false;
    const char* sleepDisplayMode = doc["sleep"]["displayMode"] | "black";
    strlcpy(settings.sleep.displayMode, sleepDisplayMode, sizeof(settings.sleep.displayMode));
    settings.sleep.sleepUntilEpoch = doc["sleep"]["sleepUntilEpoch"] | 0;

    for (int day = 0; day < 7; day++) {
        String dayKey = String(day);
        JsonObject dayObj = doc["sleep"]["days"][dayKey];

        settings.sleep.days[day].allDay = false;
        settings.sleep.days[day].slotCount = 0;

        if (dayObj.isNull()) continue;

        settings.sleep.days[day].allDay = dayObj["allDay"] | false;

        JsonArray slotsArr = dayObj["slots"];
        uint8_t loadedSlotCount = 0;
        for (JsonObject slotObj : slotsArr) {
            if (loadedSlotCount >= MAX_SLOTS_PER_DAY) break;
            uint8_t startHour   = slotObj["startHour"]   | 0;
            uint8_t startMinute = slotObj["startMinute"] | 0;
            uint8_t endHour     = slotObj["endHour"]     | 0;
            uint8_t endMinute   = slotObj["endMinute"]   | 0;
            if (startHour > 23 || endHour > 23 || startMinute > 59 || endMinute > 59) {
                Serial.printf("[SLEEP] Skipping invalid slot day=%d (%02u:%02u-%02u:%02u)\n",
                              day, startHour, startMinute, endHour, endMinute);
                continue;
            }
            SleepSlot& slot = settings.sleep.days[day].slots[loadedSlotCount];
            slot.startHour   = startHour;
            slot.startMinute = startMinute;
            slot.endHour     = endHour;
            slot.endMinute   = endMinute;
            loadedSlotCount++;
        }
        settings.sleep.days[day].slotCount = loadedSlotCount;
    }

    Serial.printf("[SLEEP] Loaded schedule: enabled=%d, displayMode=%s, override=%u\n",
                  settings.sleep.enabled,
                  settings.sleep.displayMode,
                  settings.sleep.sleepUntilEpoch);

    Serial.println("[SETTINGS] Configuration loaded successfully");
    Serial.printf("[SETTINGS] Brightness: %d, AutoRotate: %s\n",
                  settings.brightness, settings.autoRotate ? "true" : "false");

