nicolas-codemate/esp32-pixelcast/src/main.cpp
    settings.sleep = scratch;
    saveSettings();
    loopSleepTransition();
    return true;
}

static void wakeNow()
{
    settings.sleep.sleepUntilEpoch = 0;
    saveSettings();
    loopSleepTransition();
    Serial.println("[SLEEP] Wake override cleared");
}

void loopDisplay() {
    if (!wifiConnected) return;

    if (sleepIsActive()) {
        if (strcmp(settings.sleep.displayMode, "clock") == 0) {
            unsigned long sleepNow = millis();
            if (sleepNow - lastDisplayUpdate > 1000) {
                displayShowTime();
                lastDisplayUpdate = sleepNow;
            }
        }
        return;
    }

    unsigned long now = millis();
    bool needsRedraw = false;

    // ---- Notification display (priority over apps) ----
    NotificationItem* currentNotif = notifGetCurrent();
    if (currentNotif) {
        // Handle notification scroll animation
        if (notifScrollState.needsScroll) {
            if (now - lastNotifScrollUpdate >= SCROLL_SPEED) {
                lastNotifScrollUpdate = now;

                switch (notifScrollState.scrollPhase) {
                    case 0:  // pause_start
                        if (now - notifScrollState.lastScrollTime >= SCROLL_PAUSE) {
                            notifScrollState.scrollPhase = 1;
                            notifScrollState.lastScrollTime = now;
                        }
                        break;

                    case 1:  // scrolling
                        notifScrollState.scrollOffset++;
                        if (notifScrollState.scrollOffset >= notifScrollState.textWidth - notifScrollState.availableWidth + 10) {
                            notifScrollState.scrollPhase = 2;
                            notifScrollState.lastScrollTime = now;
                        }
                        needsRedraw = true;
                        break;

                    case 2:  // pause_end
                        if (now - notifScrollState.lastScrollTime >= SCROLL_PAUSE) {
                            notifScrollState.scrollOffset = 0;
                            notifScrollState.scrollPhase = 0;
                            notifScrollState.lastScrollTime = now;
                        }
                        break;
                }
            }
        }

        // Redraw notification on scroll, periodic update, or indicator animation
        bool indicatorRedraw = indicatorNeedsRedraw() && (now - lastDisplayUpdate > 50);
        if (now - lastDisplayUpdate > 1000 || needsRedraw || indicatorRedraw) {
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
        return;  // Skip app display while notification is active
    }

    // ---- Normal app display ----
    AppItem* current = appGetCurrent();
    needsRedraw = false;

    // Handle scroll animation (50ms updates for smooth scrolling)
    if (current && appScrollState.needsScroll) {
        if (now - lastScrollUpdate >= SCROLL_SPEED) {
            lastScrollUpdate = now;

            switch (appScrollState.scrollPhase) {
                case 0:  // pause_start
                    if (now - appScrollState.lastScrollTime >= SCROLL_PAUSE) {
                        appScrollState.scrollPhase = 1;
                        appScrollState.lastScrollTime = now;
                    }
                    break;

                case 1:  // scrolling
                    appScrollState.scrollOffset++;
                    // Check if text has scrolled completely
                    if (appScrollState.scrollOffset >= appScrollState.textWidth - appScrollState.availableWidth + 10) {
                        appScrollState.scrollPhase = 2;
                        appScrollState.lastScrollTime = now;
                    }
                    needsRedraw = true;
                    break;

                case 2:  // pause_end
                    if (now - appScrollState.lastScrollTime >= SCROLL_PAUSE) {
                        // Reset to beginning
                        appScrollState.scrollOffset = 0;
                        appScrollState.scrollPhase = 0;
                        appScrollState.lastScrollTime = now;
                    }
                    break;
            }
        }
    }

    // Regular display update (1000ms for non-scrolling, 50ms for indicator animation)
    bool indicatorRedraw = indicatorNeedsRedraw() && (now - lastDisplayUpdate > 50);
    if (now - lastDisplayUpdate > 1000 || needsRedraw || indicatorRedraw) {
        if (current) {
            displayShowApp(current);
        } else {
            // Fallback: show time if no apps
            displayShowTime();
        }
        lastDisplayUpdate = now;
    }
}

// ============================================================================
// Utility Functions
// ============================================================================

void logMemory() {
    Serial.printf("[MEM] Free heap: %d bytes, largest block: %d bytes\n",
        ESP.getFreeHeap(), ESP.getMaxAllocHeap());
}
